artillery.yml
config:
    target: "http://localhost:4000/"
    phases:
      - duration: 15
        arrivalRate: 60
    processor: "./gqlload.js"
scenarios:
    - name: "GraphQL Query load test"
      flow:
        - function: "testCases"
        - loop:
            - post:
                url: "/"
                json:
                  query: "{{ $loopElement.query }}"
            - log: "----------------------------------"
            - log: "Query: {{ $loopElement.name }}"
          over: cases